ACCESS_TOKEN = "1209556211:AAFgUkG4LEe9Kysp44-X-PCKerUBEyzj14I"

WELCOME_MESSAGE = """🔸 سلام! خوش آمدید.

تا به حال به بانک یا ارگانی مراجعه کردهاید که پیش از انجام درخواست شما نیاز به تایید هویت شما داشته باشند؟ ما برای طراحی یک سیستم خودکار تطبیق تصویر کارت ملی و چهرهی ایرانیان به کمک شما نیاز داریم. هدف این پروژه طراحی یک الگوریتم هوشمند برای اتوماتیک کردن این فرآیند است. دادههای فراوانی از تصاویر افراد در اینترنت به صورت آزاد وجود دارد (مانند این لینک دانشگاه امآیتی)، اما این دیتاستها چندان برای چهرههای ایرانی و نوع پوششی که در ایران مرسوم و اجباری است طراحی نشدهاند. برای برآورد عملکرد این سیستم نیاز به مجموعه دادهای «هر چه بزرگتر بهتر» از جفت تصاویر عکس روی کارت ملی و سلفی شما داریم.

🔹 اگر دوست دارید به ما در این پروژه کمک کنید، توسط این بات ابتدا یک تصویر از عکس خودتان روی کارت ملی (دقت کنید که میتوانید سایر بخشهای کارت ملی را کراپ کنید) و سپس بعد از دریافت پیام از بات، یک سلفی عادی از زاویه روبرو از خود ارسال کنید.

⚠️ دقت کنید که ما فقط به عکس شما روی کارت ملیتان نیاز داریم نه اطلاعات روی آن که جزو اطلاعات شخصی شما محسوب میشوند. برای حفظ حریم خصوصی خود این اطلاعات را کراپ کنید و فقط تصویر را ارسال کنید. یک نمونه از ارسال صحیح در زیر آمده است. در ضمن تصاویر پس از یادگیری الگوریتم شناسایی و تطبیق به طور کامل منهدم خواهند شد.

افرادی که روی این پروژه کار میکنند گروهی متشکل از دانشجویان دانشگاههای شریف و خواجه نصیر و مشغول به کار در حوزه یادگیری ماشین هستند.

در صورتی که نیاز به اطلاعات بیشتر و سوال در مورد این پروژه دارید با آیدی زیر تماس بگیرید:
@ialireza13"""

CHOOSE_BUTTON_MESSAGE = 'لطفا یکی از گزینه‌های زیر را انتخاب نمایید.'
NATIONAL_CARD_PHOTO_MESSAGE = 'تصویر عکس کارت ملی خود را ارسال نمایید.'
SELFIE_PHOTO_MESSAGE = 'عکس سلفی خود را ارسال نمایید. لطفا در عکس مستقیم به دوربین نگاه کنید.'
CHOOSE_PHOTO_MESSAGE = 'ابتدا نوع عکس را از لیست زیر مشخص سپس آن را آپلود کنید.'
